from typing import Any

import pytest


@pytest.fixture
def operations_from_excel():
    return {
        "Дата операции": [
            "08.04.2022 12:14:20",
            "07.04.2022 22:31:40",
            "07.04.2022 22:30:17",
            "05.04.2022 04:49:13",
            "04.04.2022 19:39:46",
            "04.04.2022 19:39:45",
            "04.04.2022 19:36:28",
            "04.04.2022 19:32:29",
            "04.04.2022 19:32:28",
            "03.04.2022 15:37:17",
        ],
        "Дата платежа": [
            "08.04.2022",
            "08.04.2022",
            "08.04.2022",
            "05.04.2022",
            "04.04.2022",
            "04.04.2022",
            "04.04.2022",
            "04.04.2022",
            "04.04.2022",
            "04.04.2022",
        ],
        "Номер карты": ["*9428", "*6158", "*9428", "*6158", 0, 0, "*9428", "*9428", "*9428", "*6158"],
        "Статус": ["OK", "OK", "OK", "OK", "OK", "OK", "OK", "OK", "FAILED", "OK"],
        "Сумма операции": [500.0, -858.0, 858.0, -260.0, 1000.0, -1000.0, 1000.0, 59.0, 59.0, -130.0],
        "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
        "Сумма платежа": [500.0, -858.0, 858.0, -260.0, 1000.0, -1000.0, 1000.0, 59.0, 59.0, -130.0],
        "Валюта платежа": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
        "Кэшбэк": [0, 8.0, 0, 2.0, 0, 0, 0, 0, 0, 1.0],
        "Категория": [
            "Пополнения",
            "Рестораны",
            "Переводы",
            "Супермаркеты",
            "Переводы",
            "Переводы",
            "Пополнения",
            "Бонусы",
            "Бонусы",
            "Такси",
        ],
        "MCC": [0, 5813.0, 0, 5300.0, 0, 0, 0, 0, 0, 4121.0],
        "Описание": [
            "Мария Ж.",
            "Kamin",
            "Мария К.",
            "WILDBERRIES",
            "Перевод между счетами",
            "Перевод между счетами",
            "Мария Ж.",
            "Выплата по вашему обращению",
            "Выплата по вашему обращению",
            "Ситимобил",
        ],
        "Бонусы (включая кэшбэк)": [0.0, 8.0, 0.0, 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0],
        "Округление на инвесткопилку": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        "Сумма операции с округлением": [500.0, 858.0, 858.0, 260.0, 1000.0, 1000.0, 1000.0, 59.0, 59.0, 130.0],
    }


@pytest.fixture
def operations_list_valid():
    return [
        {
            "Дата операции": "08.04.2022 12:14:20",
            "Дата платежа": "08.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма операции": 500.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 500.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Пополнения",
            "MCC": 0,
            "Описание": "Мария Ж.",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 500.0,
        },
        {
            "Дата операции": "07.04.2022 22:31:40",
            "Дата платежа": "08.04.2022",
            "Номер карты": "*6158",
            "Статус": "OK",
            "Сумма операции": -858.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -858.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 8.0,
            "Категория": "Рестораны",
            "MCC": 5813.0,
            "Описание": "Kamin",
            "Бонусы (включая кэшбэк)": 8.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 858.0,
        },
        {
            "Дата операции": "07.04.2022 22:30:17",
            "Дата платежа": "08.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма операции": 858.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 858.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": "Мария К.",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 858.0,
        },
        {
            "Дата операции": "05.04.2022 04:49:13",
            "Дата платежа": "05.04.2022",
            "Номер карты": "*6158",
            "Статус": "OK",
            "Сумма операции": -260.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -260.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2.0,
            "Категория": "Супермаркеты",
            "MCC": 5300.0,
            "Описание": "WILDBERRIES",
            "Бонусы (включая кэшбэк)": 2.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 260.0,
        },
        {
            "Дата операции": "04.04.2022 19:39:46",
            "Дата платежа": "04.04.2022",
            "Номер карты": 0,
            "Статус": "OK",
            "Сумма операции": 1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": "Перевод между счетами",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "04.04.2022 19:39:45",
            "Дата платежа": "04.04.2022",
            "Номер карты": 0,
            "Статус": "OK",
            "Сумма операции": -1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": "Перевод между счетами",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "04.04.2022 19:36:28",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма операции": 1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Пополнения",
            "MCC": 0,
            "Описание": "Мария Ж.",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "04.04.2022 19:32:29",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма операции": 59.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 59.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Бонусы",
            "MCC": 0,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 59.0,
        },
        {
            "Дата операции": "04.04.2022 19:32:28",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*9428",
            "Статус": "FAILED",
            "Сумма операции": 59.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 59.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Бонусы",
            "MCC": 0,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 59.0,
        },
        {
            "Дата операции": "03.04.2022 15:37:17",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*6158",
            "Статус": "OK",
            "Сумма операции": -130.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -130.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.0,
            "Категория": "Такси",
            "MCC": 4121.0,
            "Описание": "Ситимобил",
            "Бонусы (включая кэшбэк)": 1.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 130.0,
        },
    ]


@pytest.fixture
def currencies() -> list[str]:
    return ["USD"]


@pytest.fixture
def answer_currencies() -> dict[str, Any]:
    return {
        "base": "USD",
        "date": "2022-04-14",
        "rates": {"RUB": 92.86},
        "success": True,
        "timestamp": 1519296206,
    }


@pytest.fixture
def stocks() -> list[str]:
    return ["AAPL"]


@pytest.fixture
def answer_stocks() -> dict[str, Any]:
    return {
        "Meta Data": {
            "1. Information": "Daily Prices (open, high, low, close) and Volumes",
            "2. Symbol": "AAPL",
            "3. Last Refreshed": "2024-09-24",
            "4. Output Size": "Compact",
            "5. Time Zone": "US/Eastern",
        },
        "Time Series (Daily)": {
            "2024-09-24": {
                "1. open": "219.7800",
                "2. high": "221.1900",
                "3. low": "218.1600",
                "4. close": "220.9700",
                "5. volume": "3184114",
            },
            "2024-09-23": {
                "1. open": "218.0000",
                "2. high": "220.6200",
                "3. low": "217.2700",
                "4. close": "220.5000",
                "5. volume": "4074755",
            },
        },
    }


@pytest.fixture
def test_list_for_investment_bank() -> list[dict[str, Any]]:
    return [
        {"Transaction date": "31.12.2021 16:44:00", "Transaction amount": -160.89},
        {"Transaction date": "28.12.2021 18:24:02", "Transaction amount": -1840.0},
        {"Transaction date": "26.12.2021 20:39:43", "Transaction amount": -228.0},
        {"Transaction date": "26.12.2021 12:33:51", "Transaction amount": -34.0},
        {"Transaction date": "16.12.2021 15:01:10", "Transaction amount": -300.0},
        {"Transaction date": "20.11.2021 16:09:16", "Transaction amount": -19.99},
        {"Transaction date": "03.11.2021 13:03:16", "Transaction amount": -56.0},
        {"Transaction date": "06.10.2021 16:32:03", "Transaction amount": -94.82},
    ]


@pytest.fixture
def card_info_result():
    return [
        {"last_digits": "6158", "total_spent": 1248.00, "cashback": 12.48},
    ]
