import json

from src.services import find_numbers

test_dict = [
    {
        "Дата платежа": "19.11.2021",
        "Статус": "OK",
        "Сумма платежа": -200.0,
        "Валюта платежа": "RUB",
        "Категория": "Мобильная связь",
        "Описание": "Тинькофф Мобайл +7 995 555-55-55",
        "Номер карты": "**0809",
    }
]


def test_find_numbers():
    assert find_numbers(test_dict) == json.dumps(
        [
            {
                "Дата платежа": "19.11.2021",
                "Статус": "OK",
                "Сумма платежа": -200.0,
                "Валюта платежа": "RUB",
                "Категория": "Мобильная связь",
                "Описание": "Тинькофф Мобайл +7 995 555-55-55",
                "Номер карты": "**0809",
            }
        ],
        ensure_ascii=False,
    )
